import { Link } from "react-router-dom";

export default function ProjectInfo() {
    
    return (
        <main className="main main--usual-page">
            <Link to="/" className="form-link">
                На главную
            </Link>
            <h1 className="main-title main-title--usual-page">
                О проекте
            </h1>
            <p className="main-text">
                <b>О платформе</b>
                <br />
                Данная платформа предназначена для генерации гитарных
                соло-табулатур с использованием методов искусственного
                интеллекта. Система ориентирована на гитаристов, которые
                хотят быстро получить музыкально осмысленное соло на основе
                заданной гармонии ритм-гитары.
                <br />
                <br />
                <b>Как использовать</b>
                <br />
                Для использования системы пользователю достаточно перейти на
                страницу генерации табулатур и задать последовательность
                аккордов ритм-гитары с указанием их длительности в тактах.
                Формат ввода представляет собой пары «аккорд – длительность в
                тактах», например:
                <br />
                <i>
                    Am-1/2, C-1/2, Am-1/2, C-1/2, F-1, G-1/2, Dsus4-1/4,
                    G-1/4
                </i>
                <br />
                Дополнительно пользователь выбирает музыкальный размер — 3/4
                или 4/4, темп и жанр — после чего система генерирует
                соло-табулатуру, соответствующую заданной гармонии и
                выбранному жанру.
                <br />
                <br />
                <b>Процесс генерации</b>
                <br />
                После завершения генерации доступна возможность повторной
                генерации соло с новой вариацией, что позволяет получить
                разные музыкальные интерпретации при одинаковых входных
                данных. При наличии авторизации пользователь может сохранить
                созданную табулатуру в своём личном кабинете для дальнейшего
                использования. Кроме того, реализована возможность экспорта
                результата в текстовом и аудио форматах.
                <br />
                <br />
                <b>Об авторе</b>
                <br />
                Данный проект разработан в рамках выпускной квалификационной
                работы студента группы 4321-22 Кошелева Алексея Игоревича
                Казанского национального исследовательского технологического
                университета под названием "Разработка платформы генерации
                гитарных табулатур с использованием искусственного
                интеллекта" и направлен на исследование и практическое
                применение нейросетевых моделей в задаче алгоритмической
                генерации гитарных табулатур.
            </p>
        </main>
    );
};